[
  {
    "id": 0,
    "year": 2022,
    "yearEnd": 2024,
    "title": "Principle Studios",
    "position": "Lead Software Engineer",
    "description": "Architect and lead developer for First American Home Warranty's user and contractor portals, which consisted of four distinct applications. These were built using React, Typescript, React Hooks, and React Query, on NX, with a C#/.NET backend.",
    "image": "",
    "highlights": [
      "Complex data/user flows",
      "Prioritizing/Strategy sessions with the Product Owner",
      "Negotiate scope, assess impact and mitigate risk",
      "Shortened timeline due to Microsoft deprecating Angular 1.x",
      "Involved complete refactor of existing codebase",
      "Coded major pages, components, and services"
    ]
  },
  {
    "id": 1,
    "year": 2019,
    "yearEnd": 2022,
    "title": "Stackpath",
    "position": "Sr. Software Engineer",
    "description": "A pioneers of edge delivery, StackPath offered a blazingly fast CDN, DNS, robust WAF, cutting edge Edge Computing, serverless scripting, as well as comprehensive monitoring and security tools.",
    "image": "",
    "highlights": [
      "Frontend built using React, Typescript, Apollo Server/Client, and GraphQL",
      "Integrated websockets to provide real-time analytics to user dashboards",
      "Advanced tooling to generate graphQL layer from gRPC/protobufs",
      "Updated sites with new offerings, including serverless scripting and edge computing",
      "Created custom React charts and components for user dashboards"
    ]
  },
  {
    "id": 2,
    "year": 2017,
    "yearEnd": 2019,
    "title": "Intuit",
    "position": "Software Engineer II",
    "description": "Converted to full-time as a Software Engineer II, I was responsible for the development of the ProConnect Link application, which allowed accounts to share and track user progress in real time",
    "image": "",
    "highlights": [
      "Built components used by entire Intuit ecosystem, including TurboTax, QuickBooks, and Mint",
      "Advanced document scanning functionality with auto-filling into corresponding tax forms",
      "Micro-application architecture using React, Redux, Redux-Saga, and GraphQL",
      "Integrated with third-party services, such as DocuSign, to provide a seamless user experience",
      "Proposed and implemented a new feature that allowed accounts to custom email templates to clients"
    ]
  },
  {
    "id": 3,
    "year": 2016,
    "yearEnd": 2017,
    "title": "Copart",
    "position": "Lead Application Developer",
    "description": "Built a native mobile application, using the brand new React Native, that offered advanced searching and filtering on vehicles, as well as the ability to bid on vehicles in real-time auctions.",
    "image": "",
    "highlights": [
      "VIN Barcode/License Plate scanner using device camera",
      "Real-time bidding updates using websockets",
      "Shared mobile and web view using React Native, React, and Redux"
    ]
  },
  {
    "id": 4,
    "year": 2015,
    "yearEnd": 2016,
    "title": "Southwest Airlines",
    "position": "Software Engineer (Contractor)",
    "description": "As a core member of the WCM team, I was responsible for identifying commonalities in marketing designs for creating reusable React fragments to deliver on various devices and platforms.",
    "image": "",
    "highlights": [
      "Used Interwoven to create and manage forms and tools for marketing",
      "Created XML transformation to React JSX fragment using XPath",
      "Worked with various teams to identify device constraints",
      "Wrote ElasticSearch queries for faster search and ad results"
    ]
  },
  {
    "id": 5,
    "year": 2014,
    "yearEnd": 2015,
    "title": "Ascend Marketing",
    "position": "Lead Web Developer",
    "description": "As Lead, I was responsible for the overall digital marketing strategy, which included creating microsites and corresponding databases for lead generation. I also helped train and mentor contractors and junior employees.",
    "image": "",
    "highlights": [
      "Build email campaigns and landing pages for marketing campaigns using Angular and WordPress",
      "Created custom WordPress plugins using PHP, JavaScript & Angular",
      "Setup MySQL databases and tables for storing lead data",
      "Defined and executed queries to retrieve relevant leads for marketing campaigns",
      "Identified SEO opportunities and implemented changes to improve search rankings"
    ]
  },
  {
    "id": 6,
    "year": 2014,
    "yearEnd": 2014,
    "title": "AuditionU",
    "position": "QA Lead / Software Engineer (Contractor)",
    "description": "As QA Lead, I was responsible for identifying and fixing bugs while finalizing the product before launch.",
    "image": "",
    "highlights": [
      "Used Redmine to track identified issues",
      "Regression test entire application on specified devices and browsers",
      "Work with founder to prioritize and fix issues before launch"
    ]
  },
  {
    "id": 7,
    "year": 2012,
    "yearEnd": 2013,
    "title": "Dasha Designs",
    "position": "Webmaster",
    "description": "Responsible for updating multiple sites with new products, as well as creating new pages and features. I also worked with the owner to create new sites for new brands.",
    "image": "",
    "highlights": [
      "Added custom functionality to site using PHP, JavaScript and jQuery",
      "Updated sites with new products and features",
      "Kept sites up-to-date with latest web standards and best practices",
      "Use PhotoShop to create marketing images for new products",
      "Used iMovie for video demos of new products"
    ]
  },
  {
    "id": 8,
    "year": 2008,
    "yearEnd": 2008,
    "title": "Low Price Skates",
    "position": "Webmaster",
    "description": "My first professional job, I was responsible for updating the site with new products, as well as creating new pages and features. I also worked with the owner to create a new site for a recently aquired brand.",
    "image": "",
    "highlights": [
      "Used xCart to create new site, based on three existing sites",
      "Updated sites with new products and features",
      "Captured photos and videos of new products for marketing purposes",
      "Kept sites up-to-date with latest web standards and best practices"
    ]
  },
  {
    "id": 9,
    "year": 2003,
    "yearEnd": 2007,
    "title": "MySpace",
    "position": "Hobbyist Developer/Designer",
    "description": "Where I really honed my skills as a developer and designer. I'll never forget the 3-day stretch where I worked endlessly to create a blank canvas layout that ended up being used by thousands of pages.",
    "image": "",
    "highlights": [
      "Quite a few hard times with CSS",
      "Designed and built layouts for groups, bands, friends, and family",
      "Used PhotoShop to plan and create custom images for pages",
      "Created and moderated forums using phpBB3"
    ]
  },
  {
    "id": 10,
    "year": 1998,
    "yearEnd": 2001,
    "title": "Neopets",
    "position": "Very Junior Dev",
    "description": "The start of my late nights working with web technologies. I spent countless hours learning HTML, CSS, as well as how to use PhotoShop to create custom layouts and images for guilds and bulletin postings.",
    "image": "",
    "highlights": [
      "Sold layouts to guilds with 1000+ members for NeoPoints",
      "Used PhotoShop to create custom images based on buyer's requests",
      "Manipulated HTML and CSS to create custom layouts for guilds and bulletin postings",
      "Prompted Google to find examples of code to create custom features for guilds",
      "Researched solutions to problems on forums and chat rooms"
    ]
  },
  {
    "id": 11,
    "year": 1995,
    "yearEnd": 1997,
    "title": "The Beginning",
    "position": "Total N00B",
    "description": "My family got our first computer in 1995, and I was instantly hooked. I quickly realized web pages could be saved and modified locally, and I started learning HTML. My neighbor was an ex-Intuit, soon-to-be Google, employee gave me a few broken computers from his garage. After a quick hard drive swap, and some doubling up of the RAM, I soon realized I had a computer running Windows 95 and a valid copy of PhotoShop 3.0. I was in heaven. I quickly mastered Office, having the most fun with PowerPoint, and would help my parents with presentations for work. By the age of 8, I could disassemble and assemble computers easily, and had started hosting sites on geoCities. By 11, I had a AIM chatbot being used by hundreds. \n Also thousands of hours managing and building in:",
    "image": "",
    "highlights": [
      "2000 - The Sims",
      "1998 - Theme Hospital",
      "1996 - RollerCoaster Tycoon"
    ]
  }
]
